[
  {
    "title": "HTTP version tags",
    "description": ["The HTTP version used in each request is now shown in the Request section of each HTTP request"],
    "date": "2024-01-03T16:00:00Z",
    "tags": ["http"]
  },
  {
    "title": "Native dark-mode scrollbars",
    "description": [
      "In the past, HTTP Toolkit provided its own dark-mode scrollbars, as platform support for doing this automatically when themes were changed was poor.",
      "This has since improved, and native dark-mode scrollbars will now be used by default wherever they're available."
    ],
    "date": "2023-12-21T12:00:00Z",
    "tags": ["ui", "pro"]
  },
  {
    "title": "iOS SSL pinning demo app available",
    "description": [
      "For testing SSL pinning in interception scenarios, a new HTTP Toolkit open-source subproject is now available: [ios-ssl-pinning-demo](https://github.com/httptoolkit/ios-ssl-pinning-demo).",
      "This app demonstrates 10 different ways of sending an HTTP request on iOS, making it easy to test SSL pinning & unpinning behaviour in different environments."
    ],
    "date": "2023-12-20T12:00:00Z",
    "tags": ["ios", "subprojects", "tls"]
  },
  {
    "title": "Enable legacy TLS renegotiation for relaxed HTTPS connections",
    "description": [
      "When adding hosts to the HTTPS whitelist (relaxing HTTPS connections to access insecure servers) in the pro settings this will now also allow use of legacy TLS renegotiation settings (OpenSSL SSL_OP_LEGACY_SERVER_CONNECT setting)."
    ],
    "date": "2023-11-28T16:00:00Z",
    "tags": ["tls", "pro"]
  },
  {
    "title": "Auto-hiding for large filter inputs",
    "description": [
      "When you entered many or very long filters, the filter input box would expand. On small screens, or when this happened very significantly, this could reduce the UI space available to an annoying degree.",
      "This is now avoided: once the filter input has expanded beyond a single row, it will be auto-collapsed (back to showing just a single row) whenever it's not focused & hovered."
    ],
    "date": "2023-10-17T12:00:00Z",
    "tags": ["filters"]
  },
  {
    "title": "Add support for Mac Docker Desktop's user-only socket",
    "description": [
      "Recent versions of Docker Desktop on Mac use a per-user Docker socket.",
      "While this can be linked to the standard `/var/run/docker.sock` path, this is not always enabled, which could cause HTTP Toolkit to fail to detect (and thereby fail to intercept) Docker.",
      "This is now resolved, and HTTP Toolkit will automatically use the socket at `$HOME/.docker/run/docker.sock` on Linux & Mac if present, in preference to the system-wide socket."
    ],
    "date": "2023-10-12T12:00:00Z",
    "tags": ["docker", "interception"]
  },
  {
    "title": "Improved HTTP compatibility with unusual headers",
    "description": [
      "Previously, when sending requests with unusual headers (e.g. no content-length or transfer-encoding, or without a connection header) the behaviour."
    ],
    "date": "2023-10-12T12:00:00Z",
    "tags": ["http"]
  },
  {
    "title": "Compatibility with all ALPN protocols",
    "description": [
      "HTTP Toolkit will now accept all ALPN protocols during TLS negotiation, making it easier to intercept unusual clients and to at least glimpse the data received from non-HTTP clients.",
      "Previously TLS connections from clients using ALPN but not explicitly supporting either HTTP/1 or HTTP/2 would be rejected immediately. Now they're accepted initially, and allowed to attempt to continue. In many cases, these connections are actually negotiating some subprotocol of HTTP, so this widens interception compatibility."
    ],
    "date": "2023-10-09T12:00:00Z",
    "tags": ["tls"]
  },
  {
    "title": "Frida scripts for full Android interception & unpinning",
    "description": [
      "The existing certificate-unpinning Frida scripts have now been extended, to be able independently handle all interception required for any target application on Android.",
      "This makes it possible to precisely intercept all HTTP(S) from a single target application on an Android device, without any other device settings or configuration required, while disabling certificate pinning at the same time.",
      "This is a standalone open-source project available at https://github.com/httptoolkit/frida-interception-and-unpinning, but will be integrated into HTTP Toolkit for automated use in future."
    ],
    "date": "2023-10-24T12:00:00Z",
    "tags": ["interception", "frida", "android", "subprojects"]
  },
  {
    "title": "Android 14 support enabled",
    "description": [
      "Automatic interception of Android 14 devices is now enabled, just in time for the upcoming final release",
      "For more information on the issues here and how this works, see https://httptoolkit.com/blog/android-14-install-system-ca-certificate/."
    ],
    "date": "2023-09-21T12:00:00Z",
    "tags": ["android", "interception"]
  },
  {
    "title": "Added 'auto' theme mode to Pro settings",
    "description": [
      "In addition to the existing themes, Pro users can now select 'Auto' to automatically match the system dark/light theme."
    ],
    "date": "2023-09-18T12:00:00Z",
    "tags": ["ui", "pro"]
  },
  {
    "title": "Automatic interception for Bun and Deno",
    "description": [
      "Bun and Deno are now automatically intercepted by HTTP Toolkit's intercepted terminals, matching the existing automatic interception for Node.js."
    ],
    "date": "2023-09-14T12:00:00Z",
    "tags": ["bun", "deno", "node.js", "javascript", "inteception"]
  },
  {
    "title": "Automatic interception for snap-installed Firefox & Chromium browsers",
    "description": [
      "Previously, browsers installed via Snap on Linux were not interceptable due to Snap's sandboxing.",
      "This has now been fixed, so these browsers can be intercepted and debugging just like any other."
    ],
    "date": "2023-09-07T12:00:00Z",
    "tags": ["inteception", "linux"]
  },
  {
    "title": "Improved validation for client certificates",
    "description": [
      "Client certificates added in the Pro settings are now validated more strictly, to make it easier to know immediately if your client certificate isn't going to work.",
      "Notably if your PFX was valid and readable but did not contain both a certificate and a private key, it would be loaded but would always fail. Now, this is reported explicitly.",
      "More information is also shown for various other possible error cases too."
    ],
    "date": "2023-09-04T12:00:00Z",
    "tags": ["ui", "tls", "pro"]
  },
  {
    "title": "Manual interception option for iOS",
    "description": [
      "A new 'iOS via Manual Setup' option is now available on the Intercept page, providing easy instructions to quickly get started with iOS.",
      "In future automatic interception will be available, but this should provide a reasonable process to allow you to intercept your iOS devices immediately in the meantime."
    ],
    "date": "2023-09-04T12:00:00Z",
    "tags": ["ios", "interception"]
  },
  {
    "title": "Automatic interception of Python's aiohttp",
    "description": [
      "When intercepting Python traffic (either in Docker or an intercepted terminal) aiohttp requests were not previously captured.",
      "This has now been resolved, so all aiohttp traffic will be automatically intercepted as normal."
    ],
    "date": "2023-08-30T12:00:00Z",
    "tags": ["python", "interception"]
  },
  {
    "title": "Automatic interception of the AWS CLI",
    "description": [
      "In intercepted terminals, all traffic from the AWS CLI will now be automatically intercepted, allowing you to quickly & easily understand exactly which APIs it uses for AWS operations."
    ],
    "date": "2023-08-30T12:00:00Z",
    "tags": ["aws", "cli", "interception"]
  },
  {
    "title": "AVIF images are now shown automatically",
    "description": [
      "Like most other popular image formats (e.g. png and jpg), message bodies containing images are now automatically rendered, allowing you to see the image itself rather than just the raw bytes within."
    ],
    "date": "2023-08-18T12:00:00Z",
    "tags": ["data-formats"]
  },
  {
    "title": "HAR exports now include websocket messages",
    "description": [
      "This is exposed matching the same format as Chromium, where WebSockets have a `_resourceType` field set to `websocket`, and a `_webSocketMessages` field containing an array of messages."
    ],
    "date": "2023-08-17T12:00:00Z",
    "tags": ["websockets", "har", "pro"]
  },
  {
    "title": "Context menu actions available",
    "description": [
      "Lots of common actions are now available directly in the context menu when right clicking any row on the View page.",
      "This includes pinning & deleting rows, copying request URLs, transforming a request into a automated mock rule, exporting as various formats directly to the clipboard, and more."
    ],
    "date": "2023-08-11T12:00:00Z",
    "tags": ["ui", "rules"]
  },
  {
    "title": "Frida-JS now available, to automate Frida directly from Node.js or the web",
    "description": [
      "A new HTTP Toolkit open-source subproject is now available: [frida-js](https://github.com/httptoolkit/frida-js/).",
      "This library provides pure-js bindings for Frida, making it possible to directly connect to a Frida server via websockets (without requiring any local server or native bindings) to launch processes & inject scripts.",
      "In future this will be integrated into HTTP Toolkit, allowing lightweight interception of any detected devices without needing to download or bundle separate Frida bindings for every platform involved."
    ],
    "date": "2023-07-28T12:00:00Z",
    "tags": ["interception", "frida", "subprojects"]
  },
  {
    "title": "Electron interception available for MacOS (again)",
    "description": [
      "This was previously disabled due to MacOS changes that made it impossible to usefully select an application with the file picker.",
      "A workaround has now been developed to resolve this, and automated interception for Electron applications is once again available on MacOS."
    ],
    "date": "2023-07-13T12:00:00Z",
    "tags": ["electron", "interception", "mac"]
  },
  {
    "title": "Create a new vertical UI layout for narrow windows",
    "description": [
      "When using HTTP Toolkit on a small screen, when shrinking it to a narrow window, it will now automatically switch to a narrow layout, including a vertical layout for the View page, making it much easier to see both the list of events (at the top) and the content (below) at the same time."
    ],
    "date": "2023-07-07T12:00:00Z",
    "tags": ["ui"]
  },
  {
    "title": "Add support for trusting ECDSA CA certificates",
    "description": [
      "You can now trust additional ECDSA CA certificates in the Pro settings, in addition to the existing support for trusting RSA CA certificates."
    ],
    "date": "2023-06-21T12:00:00Z",
    "tags": ["tls", "pro"]
  },
  {
    "title": "Docker interception disabled for Windows containers",
    "description": [
      "This didn't work, and will never work without significant changes, so Docker engines in Windows container mode are now ignored and not suggested as interceptable."
    ],
    "date": "2023-06-14T12:00:00Z",
    "tags": ["docker", "interception"]
  },
  {
    "title": "Docker interception now supported on ARM64 devices",
    "description": [
      "Thanks to updates in the [Docker Socks tunnel](https://github.com/httptoolkit/docker-socks-tunnel/) build process, automatic Docker interception can now be used on ARM64 devices."
    ],
    "date": "2023-06-14T12:00:00Z",
    "tags": ["docker", "arm64", "interception"]
  },
  {
    "title": "PayPro purchases available",
    "description": [
      "HTTP Toolkit purchases now use one of two different payment processors: Paddle or PayPro.",
      "PayPro provide much better support for international payment methods like Pix, iDEAL and WeChat.",
      "The payment provider will be automatically decided at purchase time depending on your location, and the exact rules for this will change in future as this is tested. If you're sent to one payment processor and you'd prefer the other, please get in touch and this can be handled manually."
    ],
    "date": "2023-04-25T12:00:00Z",
    "tags": ["meta", "pro", "payments"]
  },
  {
    "title": "Custom OpenAPI support",
    "description": [
      "Pro users can now load their own custom OpenAPI specs into HTTP Toolkit to enable automatic validation & inline API metadata for all matching requests."
    ],
    "date": "2023-03-20T12:00:00Z",
    "tags": ["openapi", "apis", "pro"]
  },
  {
    "title": "Custom rule naming",
    "description": [
      "Rules on the Mock page can now be given custom names, just click the pencil icon to provide your own alias so you can quickly & easily understand what each rule is for."
    ],
    "date": "2023-03-17T12:00:00Z",
    "tags": ["rules"]
  },
  {
    "title": "Message decoding error info",
    "description": [
      "Request & response bodies that fail to decode are now given an explicit banner, explaining which encoding failed, what the error was, and then showing the raw (still-encoded) data below to debug further"
    ],
    "date": "2023-03-09T12:00:00Z",
    "tags": ["http", "errors"]
  },
  {
    "title": "More APIs added",
    "description": [
      "New APIs have been added to the built-in API repository, providing automatic validation & debugging metadatta for 500 more APIs, from 1Password to Xero.",
      "Notable additions include OpenAI, Notion, Asan, Docusign, Plaid, Parliament.uk, Vercel, and 83 new AWS APIs."
    ],
    "date": "2023-03-08T12:00:00Z",
    "tags": ["openapi", "apis", "pro"]
  },
  {
    "title": "Matched mock rule tags",
    "description": [
      "Requests are now tagged with the details of any mock rules that affected them en route.",
      "This shows for all requests that weren't simply passed through untouched, and can be clicked to jump straight to the corresponding rule.",
      "In addition, a Mock icon is shown on all such requests in the View page list, so you can quickly spot them within your intercepted traffic."
    ],
    "date": "2023-02-22T12:00:00Z",
    "tags": ["rules"]
  },
  {
    "title": "Headers filter added",
    "description": [
      "A new `headers` filter has been added, in addition to the existing `header` filter, allowing you to search _all_ headers for a given value."
    ],
    "date": "2023-02-15T12:00:00Z",
    "tags": ["http", "filters"]
  },
  {
    "title": "Contains() filter added",
    "description": [
      "A new `contains(x)` filter has been added, allowing you to search all possible fields (URLs, headers, bodies, websocket messages, WebRTC channels, you name it) at once."
    ],
    "date": "2023-02-13T12:00:00Z",
    "tags": ["http", "filters"]
  },
  {
    "title": "Automatic Docker interception",
    "description": [
      "You can now intercept, debug & rewrite all traffic from any Docker container in just a couple of clicks.",
      "Docker containers can be intercepted in two ways: by creating them within an intercepted terminal, or by attaching to an existing container in the new 'Attach to Docker Container' option on the Intercept page.",
      "For more information, see the docs at https://httptoolkit.com/docs/guides/docker/."
    ],
    "date": "2022-11-30T12:00:00Z",
    "tags": ["docker", "interception"]
  },
  {
    "title": "New rules to hard-reset connections",
    "description": [
      "You can now create mock rules with a 'Forcibly reset the connection' action, which will immediately send a TCP RST packet, uncleanly closing the matching connection (or a RST_STREAM frame, for HTTP/2)."
    ],
    "date": "2022-11-11T12:00:00Z",
    "tags": ["rules", "errors", "pro"]
  },
  {
    "title": "Improved handling of upstream errors",
    "description": [
      "Upstream connection errors are now more clearly shown in the UI, and more accurately simulated back to downstream clients."
    ],
    "date": "2022-11-11T12:00:00Z",
    "tags": ["errors"]
  },
  {
    "title": "TLS tunnelling",
    "description": [
      "It's now possible to exclude hostnames from TLS interception entirely, creating an unintercepted TLS tunnel straight through HTTP Toolkit to the target server.",
      "This can be useful if you hit problems with interception of specific hostnames, due to certificate pinning, non-HTTP traffic, or TLS fingerprinting."
    ],
    "date": "2022-11-08T12:00:00Z",
    "tags": ["tls", "pro"]
  },
  {
    "title": "Website moved from httptoolkit.tech to httptoolkit.com",
    "description": [
      "The HTTP Toolkit website has been migrated to an easier to remember & more trustable .com domain, after a generous user how happened to own it already donated the domain to the project.",
      "Note that this is only used for the public website. Various internal services remain hosted on .tech, and this will continue in future, both for simplicity and to provide some origin isolation between the two."
    ],
    "date": "2022-10-05T12:00:00Z",
    "tags": ["meta"]
  }
]
