[
  {
    "link": "https://x.com/pimterry/status/1795861405846949903",
    "source": "Brian Reid",
    "description": "Creator of the first internet firewall, and Grace Murray Hopper award winner",
    "quote": "HTTP Toolkit is a strikingly high-quality system that is crucial to my ability to debug and repair complex website problems.\n...\nI cannot imagine tackling any future http-related problem without it."
  },
  {
    "link": "https://web.archive.org/web/20230713233655/https://usventure.news/top-14-software-testing-tools-for-startups-in-2023-a-detailed-overview/#HTTP_Toolkit",
    "source": "US Venture News",
    "description": "Top 14 Software Testing Tools for Startups in 2023",
    "quote": "HTTP Toolkit is a powerful tool for examining HTTP traffic...\n\nIt's a versatile tool ideal for monitoring traffic and prototyping new endpoints or services."
  },
  {
    "link": "https://medium.com/@xandebianchi/http-toolkit-get-post-and-put-it-into-your-programming-or-testing-routine-47aa98a8b672",
    "source": "Alexandre Bianchi",
    "description": "HTTP Toolkit: GET, POST and PUT it into your programming or testing routine",
    "quote": "I came across the HTTP Toolkit, a free and also an open-source tool that is very quick to install and use, which gets right to the point"
  },
  {
    "link": "https://medium.com/@veeresh.charantimath8/https-in-android-a-false-sense-of-security-man-in-the-middle-669d8751bbd6",
    "source": "Veeresh Charantimath on Medium",
    "description": "HTTPS in Android: A false sense of security (Man in the Middle)",
    "quote": "There are many proxy servers to choose from for Android, the most easy to use I would say from the lot is HTTP Toolkit. The setup is a breeze, if you are coming from Charles Proxy or Proxyman etc, you will definitely love the simplicity."
  },
  {
    "link": "https://web.archive.org/web/20210711060217/https://blog.bearer.sh/api-debugging-tools/#httptoolkit",
    "source": "Bearer.sh",
    "description": "Top Tools to Make Debugging APIs Easier",
    "quote": "Where I had trouble getting Fiddler to recognize calls made from my terminal, HTTP Toolkit just worked immediately."
  },
  {
    "link": "https://blog.logrocket.com/debug-encrypted-network-traffic-react-native/",
    "source": "Logrocket",
    "description": "How to debug encrypted network traffic in React Native",
    "quote": "HTTP Toolkit is a nice looking and intuitive tool to intercept, view, and debug HTTP(S) endpoints...\n\nDuring the preparation of this article, HTTP Toolkit has been the tool working best out of the box — no configuration was necessary."
  },
  {
    "link": "https://dev-tester.com/test-your-apis-further-using-http-toolkit/",
    "source": "Dev Tester",
    "description": "Test Your APIs Further Using HTTP Toolkit",
    "quote": "This overview of HTTP Toolkit barely scratches the surface of what it can do for you...\n\nIf you're a tester or developer who has to check these kinds of applications or services, HTTP Toolkit is a valuable tool to have around."
  },
  {
    "link": "https://geekflare.com/http-client-tools/",
    "source": "Geekflare",
    "description": "HTTP Client and Web Debugging Proxy to Troubleshoot Applications",
    "quote": "Unlike other HTTP debuggers, HTTP Toolkit provides automatically targeted interception for specific clients, including HTTPS setup, rather than intercepting everything from your entire computer, and so avoids capturing irrelevant traffic or disrupting other applications."
  },

  {
    "link": "https://infear.org/#rec688035858",
    "source": "Kids Without Fear",
    "description": "How we use technologies to help kids alleviate anxiety",
    "quote": "Httptoolkit is the only app that can debug connections issues within a LIVE Docker container with SSL! We are able to resolve issues in minutes instead of days."
  },
  {
    "link": "https://nordicapis.com/top-25-api-testing-tools/",
    "source": "Nordic APIs",
    "description": "Top 25+ API Testing Tools",
    "quote": "...super helpful for debugging, testing, and quick API prototyping"
  },
  {
    "link": "https://dev-tester.com/test-your-apis-further-using-http-toolkit/",
    "source": "Dev Tester",
    "description": "Test Your APIs Further Using HTTP Toolkit",
    "quote": "Even better than having multiple options to collect HTTP traffic is how dead-simple it is to begin accumulating valuable data from your applications and services."
  }
]
